GT2/RANS/notUsed/v2f_highRE/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

/*
    {
        action  new;
        name    internalcells1;
        type    cellSet;

        source  boxToCell;
        sourceInfo
        {
            box (-16 -0.5 -10) (-15.5 0.5 10);	
        }
    }
*/

    {
        action  new;
        name    slipwall;
        type    faceSet;

        source  boxToFace;
        sourceInfo
        {
        //    box (-10-10 -10) (0 0.1 10);
            box (-5 -10 -1) (0 0 1);		
        }
    }

);

// ************************************************************************* //
